БИТУправление_медицинским_центром_демо/src/Documents/ОтметкаВыполненияМедосмотра/ОтметкаВыполненияМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтметкаВыполненияМедосмотра</name>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеМедОсмотра</name>
    <type>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействияМедосмотра</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыПриема</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПараметрыHTML</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЗначенияПараметровHTML/ЗначенияПараметровHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияПараметровHTML</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ПараметрыHTML</types>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПараметрыHTML</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументУстановкиЗначенияПараметраПриема</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексШаблона</name>
    <comment>Индекс строки шаблона приема в документе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ОтметкаВыполненияМедосмотра/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	НаборЗаписейПараметры = РегистрыСведений.ЗначенияПараметровHTML.СоздатьНаборЗаписей();
	НаборЗаписейПараметры.Отбор.Документ.Установить(Ссылка);
	
	Если ПометкаУдаления Тогда
		МедосмотрыСервер.ОчиститьОтметкиВыполненияДействияМедосмотра(Ссылка);
		НаборЗаписейПараметры.Прочитать();
		НаборЗаписейПараметры.Очистить();
	Иначе
		ТаблицаОтметок = Новый ТаблицаЗначений;
		ТаблицаОтметок.Колонки.Добавить("Действие");
		ТаблицаОтметок.Колонки.Добавить("Выполнено");
		ТаблицаОтметок.Колонки.Добавить("Изменено");
		Для Каждого СтрокаДействие Из ДействияМедосмотра Цикл
			ТаблицаОтметок.Добавить().Действие = СтрокаДействие.Действие;
		КонецЦикла;
		ТаблицаОтметок.ЗаполнитьЗначения(Истина, "Выполнено, Изменено");
		
		МедосмотрыСервер.ЗаписатьОтметкиВыполненияДействияМедосмотра(Ссылка, ПрохождениеМедОсмотра, ТаблицаОтметок, Дата);
		
	КонецЕсли;
	
	НаборЗаписейПараметры.Записать();
	
КонецПроцедуры

#КонецОбласти
